lambda/src/test/resources/NewspaperDelivery/EchoLegacy/SaturdayQuarterly/Subscription.json

{
"success": true,
"id": "id",
"accountId": "accId",
"accountNumber": "accNum",
"accountName": "accName",
"invoiceOwnerAccountId": "accId",
"invoiceOwnerAccountNumber": "accNum",
"invoiceOwnerAccountName": "accName",
"subscriptionNumber": "subNum",
"version": 11,
"revision": "11.0",
"termType": "TERMED",
"invoiceSeparately": false,
"contractEffectiveDate": "2016-08-07",
"serviceActivationDate": "2016-08-07",
"customerAcceptanceDate": "2016-08-30",
"subscriptionStartDate": "2016-08-22",
"subscriptionEndDate": "2023-02-19",
"termStartDate": "2022-02-19",
"termEndDate": "2023-02-19",
"initialTerm": 181,
"initialTermPeriodType": "Day",
"currentTerm": 12,
"currentTermPeriodType": "Month",
"autoRenew": true,
"renewalSetting": "RENEW_WITH_SPECIFIC_TERM",
"renewalTerm": 12,
"renewalTermPeriodType": "Month",
"contractedMrr": 13.43,
"totalContractedValue": 1030.97,
"notes": null,
"status": "Active",
"TrialPeriodPrice__c": null,
"CanadaHandDelivery__c": null,
"QuoteNumber__QT": null,
"GifteeIdentityId__c": null,
"OpportunityName__QT": null,
"GiftNotificationEmailDate__c": null,
"Gift_Subscription__c": "No",
"TrialPeriodDays__c": null,
"CreatedRequestId__c": null,
"AcquisitionSource__c": null,
"CreatedByCSR__c": null,
"CASSubscriberID__c": null,
"LastPriceChangeDate__c": null,
"InitialPromotionCode__c": null,
"CpqBundleJsonId__QT": null,
"RedemptionCode__c": null,
"QuoteType__QT": null,
"GiftRedemptionDate__c": null,
"QuoteBusinessType__QT": null,
"SupplierCode__c": null,
"legacy_cat__c": "Sat",
"AcquisitionCase__c": null,
"ReaderType__c": null,
"ActivationDate__c": "2021-11-26T14:27:37.91",
"UserCancellationReason__c": null,
"CorporateAccountId__c": null,
"OpportunityCloseDate__QT": null,
"IPaddress__c": null,
"IPCountry__c": null,
"PromotionCode__c": null,
"OriginalSubscriptionStartDate__c": null,
"LegacyContractStartDate__c": "2016-08-22",
"CancellationReason__c": null,
"billToContact": null,
"paymentTerm": null,
"cancelReason": null,
"ratePlans": [
{
"id": "id",
"lastChangeType": "Add",
"productId": "2c92a0ff5345f9200153559c6d2a3385",
"productName": "Discounts",
"productSku": "ABC-00000012",
"productRatePlanId": "2c92a0fe7375d60901737c64808e4be1",
"ratePlanName": "DO NOT USE MANUALLY: Delivery-problem credit - automated - Home Delivery",
"ratePlanCharges": [
{
"id": "id",
"originalChargeId": "origChgId",
"productRatePlanChargeId": "2c92a0fe7375d60901737c6480bc4be3",
"number": "C-03017180",
"name": "Delivery-problem credit",
"type": "OneTime",
"model": "FlatFee",
"uom": null,
"version": 1,
"pricingSummary": "GBP-3.1",
"priceChangeOption": null,
"priceIncreasePercentage": null,
"currency": "GBP",
"price": -3.100000000,
"tiers": null,
"chargeModelConfiguration": null,
"inputArgumentId": null,
"includedUnits": null,
"overagePrice": null,
"discountPercentage": null,
"discountAmount": null,
"applyDiscountTo": null,
"discountLevel": null,
"discountClass": null,
"discountApplyDetails": [],
"billingDay": null,
"listPriceBase": null,
"billingPeriod": null,
"specificBillingPeriod": null,
"billingTiming": null,
"ratingGroup": null,
"billingPeriodAlignment": null,
"quantity": 1.000000000,
"smoothingModel": null,
"numberOfPeriods": null,
"overageCalculationOption": null,
"overageUnusedUnitsCreditOption": null,
"unusedUnitsCreditRates": null,
"usageRecordRatingOption": null,
"segment": 1,
"effectiveStartDate": "2021-08-30",
"effectiveEndDate": "2021-08-31",
"processedThroughDate": "2021-08-31",
"chargedThroughDate": "2021-08-31",
"done": true,
"triggerDate": null,
"triggerEvent": "CustomerAcceptance",
"endDateCondition": "One_Time",
"upToPeriodsType": null,
"upToPeriods": null,
"specificEndDate": null,
"mrr": null,
"dmrc": null,
"tcv": -3.100000000,
"dtcv": -3.100000000,
"originalOrderDate": null,
"amendedByOrderOn": null,
"description": "",
"HolidayStart__c": "2021-06-19",
"HolidayEnd__c": "2021-06-19",
"ForceSync__c": null
}
],
"subscriptionProductFeatures": [],
"externallyManagedPlanId": null
},
{
"id": "id",
"lastChangeType": "Add",
"productId": "2c92a0ff5345f9200153559c6d2a3385",
"productName": "Discounts",
"productSku": "ABC-00000012",
"productRatePlanId": "2c92a0fe7375d60901737c64808e4be1",
"ratePlanName": "DO NOT USE MANUALLY: Delivery-problem credit - automated - Home Delivery",
"ratePlanCharges": [
{
"id": "id",
"originalChargeId": "origChgId",
"productRatePlanChargeId": "2c92a0fe7375d60901737c6480bc4be3",
"number": "C-02999521",
"name": "Delivery-problem credit",
"type": "OneTime",
"model": "FlatFee",
"uom": null,
"version": 1,
"pricingSummary": "GBP-3.1",
"priceChangeOption": null,
"priceIncreasePercentage": null,
"currency": "GBP",
"price": -3.100000000,
"tiers": null,
"chargeModelConfiguration": null,
"inputArgumentId": null,
"includedUnits": null,
"overagePrice": null,
"discountPercentage": null,
"discountAmount": null,
"applyDiscountTo": null,
"discountLevel": null,
"discountClass": null,
"discountApplyDetails": [],
"billingDay": null,
"listPriceBase": null,
"billingPeriod": null,
"specificBillingPeriod": null,
"billingTiming": null,
"ratingGroup": null,
"billingPeriodAlignment": null,
"quantity": 1.000000000,
"smoothingModel": null,
"numberOfPeriods": null,
"overageCalculationOption": null,
"overageUnusedUnitsCreditOption": null,
"unusedUnitsCreditRates": null,
"usageRecordRatingOption": null,
"segment": 1,
"effectiveStartDate": "2021-08-30",
"effectiveEndDate": "2021-08-31",
"processedThroughDate": "2021-08-31",
"chargedThroughDate": "2021-08-31",
"done": true,
"triggerDate": null,
"triggerEvent": "CustomerAcceptance",
"endDateCondition": "One_Time",
"upToPeriodsType": null,
"upToPeriods": null,
"specificEndDate": null,
"mrr": null,
"dmrc": null,
"tcv": -3.100000000,
"dtcv": -3.100000000,
"originalOrderDate": null,
"amendedByOrderOn": null,
"description": "",
"HolidayStart__c": "2021-06-05",
"HolidayEnd__c": "2021-06-05",
"ForceSync__c": null
}
],
"subscriptionProductFeatures": [],
"externallyManagedPlanId": null
},
{
"id": "id",
"lastChangeType": "Add",
"productId": "2c92a0ff5345f9200153559c6d2a3385",
"productName": "Discounts",
"productSku": "ABC-00000012",
"productRatePlanId": "2c92a0fe7375d60901737c64808e4be1",
"ratePlanName": "DO NOT USE MANUALLY: Delivery-problem credit - automated - Home Delivery",
"ratePlanCharges": [
{
"id": "id",
"originalChargeId": "origChgId",
"productRatePlanChargeId": "2c92a0fe7375d60901737c6480bc4be3",
"number": "C-02983363",
"name": "Delivery-problem credit",
"type": "OneTime",
"model": "FlatFee",
"uom": null,
"version": 1,
"pricingSummary": "GBP-3.1",
"priceChangeOption": null,
"priceIncreasePercentage": null,
"currency": "GBP",
"price": -3.100000000,
"tiers": null,
"chargeModelConfiguration": null,
"inputArgumentId": null,
"includedUnits": null,
"overagePrice": null,
"discountPercentage": null,
"discountAmount": null,
"applyDiscountTo": null,
"discountLevel": null,
"discountClass": null,
"discountApplyDetails": [],
"billingDay": null,
"listPriceBase": null,
"billingPeriod": null,
"specificBillingPeriod": null,
"billingTiming": null,
"ratingGroup": null,
"billingPeriodAlignment": null,
"quantity": 1.000000000,
"smoothingModel": null,
"numberOfPeriods": null,
"overageCalculationOption": null,
"overageUnusedUnitsCreditOption": null,
"unusedUnitsCreditRates": null,
"usageRecordRatingOption": null,
"segment": 1,
"effectiveStartDate": "2021-05-30",
"effectiveEndDate": "2021-05-31",
"processedThroughDate": "2021-05-31",
"chargedThroughDate": "2021-05-31",
"done": true,
"triggerDate": null,
"triggerEvent": "CustomerAcceptance",
"endDateCondition": "One_Time",
"upToPeriodsType": null,
"upToPeriods": null,
"specificEndDate": null,
"mrr": null,
"dmrc": null,
"tcv": -3.100000000,
"dtcv": -3.100000000,
"originalOrderDate": null,
"amendedByOrderOn": null,
"description": "",
"HolidayStart__c": "2021-05-22",
"HolidayEnd__c": "2021-05-22",
"ForceSync__c": null
}
],
"subscriptionProductFeatures": [],
"externallyManagedPlanId": null
},
{
"id": "id",
"lastChangeType": "Add",
"productId": "2c92a0ff5345f9200153559c6d2a3385",
"productName": "Discounts",
"productSku": "ABC-00000012",
"productRatePlanId": "2c92a00d6f9de7f6016f9f6f52765aa4",
"ratePlanName": "DO NOT USE MANUALLY: Delivery-problem credit - automated",
"ratePlanCharges": [
{
"id": "id",
"originalChargeId": "origChgId",
"productRatePlanChargeId": "2c92a00d6f9de7f6016f9f6f529e5aaf",
"number": "C-02594550",
"name": "Delivery-problem credit",
"type": "OneTime",
"model": "FlatFee",
"uom": null,
"version": 1,
"pricingSummary": "GBP-3.1",
"priceChangeOption": null,
"priceIncreasePercentage": null,
"currency": "GBP",
"price": -3.100000000,
"tiers": null,
"chargeModelConfiguration": null,
"inputArgumentId": null,
"includedUnits": null,
"overagePrice": null,
"discountPercentage": null,
"discountAmount": null,
"applyDiscountTo": null,
"discountLevel": null,
"discountClass": null,
"discountApplyDetails": [],
"billingDay": null,
"listPriceBase": null,
"billingPeriod": null,
"specificBillingPeriod": null,
"billingTiming": null,
"ratingGroup": null,
"billingPeriodAlignment": null,
"quantity": 1.000000000,
"smoothingModel": null,
"numberOfPeriods": null,
"overageCalculationOption": null,
"overageUnusedUnitsCreditOption": null,
"unusedUnitsCreditRates": null,
"usageRecordRatingOption": null,
"segment": 1,
"effectiveStartDate": "2020-11-30",
"effectiveEndDate": "2020-12-01",
"processedThroughDate": "2020-12-01",
"chargedThroughDate": "2020-12-01",
"done": true,
"triggerDate": null,
"triggerEvent": "CustomerAcceptance",
"endDateCondition": "One_Time",
"upToPeriodsType": null,
"upToPeriods": null,
"specificEndDate": null,
"mrr": null,
"dmrc": null,
"tcv": -3.100000000,
"dtcv": -3.100000000,
"originalOrderDate": null,
"amendedByOrderOn": null,
"description": "",
"HolidayStart__c": "2020-09-05",
"HolidayEnd__c": "2020-09-05",
"ForceSync__c": null
}
],
"subscriptionProductFeatures": [],
"externallyManagedPlanId": null
},
{
"id": "id",
"productId": "2c92a0ff55a0e4940155dfa589da2591",
"productName": "Newspaper Delivery",
"productSku": "ABC-00000013",
"productRatePlanId": "2c92a0ff56fe33f001572334561765c1",
"ratePlanName": "Echo-Legacy",
"ratePlanCharges": [
{
"id": "id",
"originalChargeId": "origChgId",
"productRatePlanChargeId": "2c92a0ff56fe33f00157233456f865eb",
"number": "C-00336410",
"name": "Wednesday",
"type": "Recurring",
"model": "FlatFee",
"uom": null,
"version": 7,
"pricingSummary": "GBP0",
"priceChangeOption": "NoChange",
"priceIncreasePercentage": null,
"currency": "GBP",
"price": 0.000000000,
"tiers": null,
"chargeModelConfiguration": null,
"inputArgumentId": null,
"includedUnits": null,
"overagePrice": null,
"discountPercentage": null,
"discountAmount": null,
"applyDiscountTo": null,
"discountLevel": null,
"discountClass": null,
"discountApplyDetails": [],
"billingDay": "DefaultFromCustomer",
"listPriceBase": "Per_Billing_Period",
"billingPeriod": "Month",
"specificBillingPeriod": null,
"billingTiming": "IN_ADVANCE",
"ratingGroup": null,
"billingPeriodAlignment": "AlignToCharge",
"quantity": 1.000000000,
"smoothingModel": null,
"numberOfPeriods": null,
"overageCalculationOption": null,
"overageUnusedUnitsCreditOption": null,
"unusedUnitsCreditRates": null,
"usageRecordRatingOption": null,
"segment": 1,
"effectiveStartDate": "2016-08-30",
"effectiveEndDate": "2023-02-19",
"processedThroughDate": "2022-02-28",
"chargedThroughDate": "2022-03-30",
"done": false,
"triggerDate": null,
"triggerEvent": "CustomerAcceptance",
"endDateCondition": "Subscription_End",
"upToPeriodsType": null,
"upToPeriods": null,
"specificEndDate": null,
"mrr": 0.000000000,
"dmrc": 0.000000000,
"tcv": 0.000000000,
"dtcv": 0.000000000,
"originalOrderDate": null,
"amendedByOrderOn": null,
"description": "",
"HolidayStart__c": null,
"HolidayEnd__c": null,
"ForceSync__c": null
},
{
"id": "id",
"originalChargeId": "origChgId",
"productRatePlanChargeId": "2c92a0ff56fe33f001572334573865f8",
"number": "C-00336413",
"name": "Monday",
"type": "Recurring",
"model": "FlatFee",
"uom": null,
"version": 7,
"pricingSummary": "GBP0",
"priceChangeOption": "NoChange",
"priceIncreasePercentage": null,
"currency": "GBP",
"price": 0.000000000,
"tiers": null,
"chargeModelConfiguration": null,
"inputArgumentId": null,
"includedUnits": null,
"overagePrice": null,
"discountPercentage": null,
"discountAmount": null,
"applyDiscountTo": null,
"discountLevel": null,
"discountClass": null,
"discountApplyDetails": [],
"billingDay": "DefaultFromCustomer",
"listPriceBase": "Per_Billing_Period",
"billingPeriod": "Month",
"specificBillingPeriod": null,
"billingTiming": "IN_ADVANCE",
"ratingGroup": null,
"billingPeriodAlignment": "AlignToCharge",
"quantity": 1.000000000,
"smoothingModel": null,
"numberOfPeriods": null,
"overageCalculationOption": null,
"overageUnusedUnitsCreditOption": null,
"unusedUnitsCreditRates": null,
"usageRecordRatingOption": null,
"segment": 1,
"effectiveStartDate": "2016-08-30",
"effectiveEndDate": "2023-02-19",
"processedThroughDate": "2022-02-28",
"chargedThroughDate": "2022-03-30",
"done": false,
"triggerDate": null,
"triggerEvent": "CustomerAcceptance",
"endDateCondition": "Subscription_End",
"upToPeriodsType": null,
"upToPeriods": null,
"specificEndDate": null,
"mrr": 0.000000000,
"dmrc": 0.000000000,
"tcv": 0.000000000,
"dtcv": 0.000000000,
"originalOrderDate": null,
"amendedByOrderOn": null,
"description": "",
"HolidayStart__c": null,
"HolidayEnd__c": null,
"ForceSync__c": null
},
{
"id": "id",
"originalChargeId": "origChgId",
"productRatePlanChargeId": "2c92a0ff56fe33f00157233457be6611",
"number": "C-00336419",
"name": "Saturday",
"type": "Recurring",
"model": "FlatFee",
"uom": null,
"version": 7,
"pricingSummary": "GBP40.29",
"priceChangeOption": "NoChange",
"priceIncreasePercentage": null,
"currency": "GBP",
"price": 40.290000000,
"tiers": null,
"chargeModelConfiguration": null,
"inputArgumentId": null,
"includedUnits": null,
"overagePrice": null,
"discountPercentage": null,
"discountAmount": null,
"applyDiscountTo": null,
"discountLevel": null,
"discountClass": null,
"discountApplyDetails": [],
"billingDay": "DefaultFromCustomer",
"listPriceBase": "Per_Billing_Period",
"billingPeriod": "Quarter",
"specificBillingPeriod": null,
"billingTiming": "IN_ADVANCE",
"ratingGroup": null,
"billingPeriodAlignment": "AlignToCharge",
"quantity": 1.000000000,
"smoothingModel": null,
"numberOfPeriods": null,
"overageCalculationOption": null,
"overageUnusedUnitsCreditOption": null,
"unusedUnitsCreditRates": null,
"usageRecordRatingOption": null,
"segment": 1,
"effectiveStartDate": "2016-08-30",
"effectiveEndDate": "2023-02-19",
"processedThroughDate": "2022-02-28",
"chargedThroughDate": "2022-05-30",
"done": false,
"triggerDate": null,
"triggerEvent": "CustomerAcceptance",
"endDateCondition": "Subscription_End",
"upToPeriodsType": null,
"upToPeriods": null,
"specificEndDate": null,
"mrr": 13.430000000,
"dmrc": 0.000000000,
"tcv": 1043.372068960,
"dtcv": 161.160000000,
"originalOrderDate": null,
"amendedByOrderOn": null,
"description": "Migrated sub",
"HolidayStart__c": null,
"HolidayEnd__c": null,
"ForceSync__c": null
},
{
"id": "id",
"originalChargeId": "origChgId",
"productRatePlanChargeId": "2c92a0ff56fe33f001572334567b65d4",
"number": "C-00336404",
"name": "Thursday",
"type": "Recurring",
"model": "FlatFee",
"uom": null,
"version": 7,
"pricingSummary": "GBP0",
"priceChangeOption": "NoChange",
"priceIncreasePercentage": null,
"currency": "GBP",
"price": 0.000000000,
"tiers": null,
"chargeModelConfiguration": null,
"inputArgumentId": null,
"includedUnits": null,
"overagePrice": null,
"discountPercentage": null,
"discountAmount": null,
"applyDiscountTo": null,
"discountLevel": null,
"discountClass": null,
"discountApplyDetails": [],
"billingDay": "DefaultFromCustomer",
"listPriceBase": "Per_Billing_Period",
"billingPeriod": "Month",
"specificBillingPeriod": null,
"billingTiming": "IN_ADVANCE",
"ratingGroup": null,
"billingPeriodAlignment": "AlignToCharge",
"quantity": 1.000000000,
"smoothingModel": null,
"numberOfPeriods": null,
"overageCalculationOption": null,
"overageUnusedUnitsCreditOption": null,
"unusedUnitsCreditRates": null,
"usageRecordRatingOption": null,
"segment": 1,
"effectiveStartDate": "2016-08-30",
"effectiveEndDate": "2023-02-19",
"processedThroughDate": "2022-02-28",
"chargedThroughDate": "2022-03-30",
"done": false,
"triggerDate": null,
"triggerEvent": "CustomerAcceptance",
"endDateCondition": "Subscription_End",
"upToPeriodsType": null,
"upToPeriods": null,
"specificEndDate": null,
"mrr": 0.000000000,
"dmrc": 0.000000000,
"tcv": 0.000000000,
"dtcv": 0.000000000,
"originalOrderDate": null,
"amendedByOrderOn": null,
"description": "",
"HolidayStart__c": null,
"HolidayEnd__c": null,
"ForceSync__c": null
},
{
"id": "id",
"originalChargeId": "origChgId",
"productRatePlanChargeId": "2c92a0ff56fe33f001572334564265c9",
"number": "C-00336401",
"name": "Tuesday",
"type": "Recurring",
"model": "FlatFee",
"uom": null,
"version": 7,
"pricingSummary": "GBP0",
"priceChangeOption": "NoChange",
"priceIncreasePercentage": null,
"currency": "GBP",
"price": 0.000000000,
"tiers": null,
"chargeModelConfiguration": null,
"inputArgumentId": null,
"includedUnits": null,
"overagePrice": null,
"discountPercentage": null,
"discountAmount": null,
"applyDiscountTo": null,
"discountLevel": null,
"discountClass": null,
"discountApplyDetails": [],
"billingDay": "DefaultFromCustomer",
"listPriceBase": "Per_Billing_Period",
"billingPeriod": "Month",
"specificBillingPeriod": null,
"billingTiming": "IN_ADVANCE",
"ratingGroup": null,
"billingPeriodAlignment": "AlignToCharge",
"quantity": 1.000000000,
"smoothingModel": null,
"numberOfPeriods": null,
"overageCalculationOption": null,
"overageUnusedUnitsCreditOption": null,
"unusedUnitsCreditRates": null,
"usageRecordRatingOption": null,
"segment": 1,
"effectiveStartDate": "2016-08-30",
"effectiveEndDate": "2023-02-19",
"processedThroughDate": "2022-02-28",
"chargedThroughDate": "2022-03-30",
"done": false,
"triggerDate": null,
"triggerEvent": "CustomerAcceptance",
"endDateCondition": "Subscription_End",
"upToPeriodsType": null,
"upToPeriods": null,
"specificEndDate": null,
"mrr": 0.000000000,
"dmrc": 0.000000000,
"tcv": 0.000000000,
"dtcv": 0.000000000,
"originalOrderDate": null,
"amendedByOrderOn": null,
"description": "",
"HolidayStart__c": null,
"HolidayEnd__c": null,
"ForceSync__c": null
},
{
"id": "id",
"originalChargeId": "origChgId",
"productRatePlanChargeId": "2c92a0ff56fe33f00157233456b965de",
"number": "C-00336407",
"name": "Friday",
"type": "Recurring",
"model": "FlatFee",
"uom": null,
"version": 7,
"pricingSummary": "GBP0",
"priceChangeOption": "NoChange",
"priceIncreasePercentage": null,
"currency": "GBP",
"price": 0.000000000,
"tiers": null,
"chargeModelConfiguration": null,
"inputArgumentId": null,
"includedUnits": null,
"overagePrice": null,
"discountPercentage": null,
"discountAmount": null,
"applyDiscountTo": null,
"discountLevel": null,
"discountClass": null,
"discountApplyDetails": [],
"billingDay": "DefaultFromCustomer",
"listPriceBase": "Per_Billing_Period",
"billingPeriod": "Month",
"specificBillingPeriod": null,
"billingTiming": "IN_ADVANCE",
"ratingGroup": null,
"billingPeriodAlignment": "AlignToCharge",
"quantity": 1.000000000,
"smoothingModel": null,
"numberOfPeriods": null,
"overageCalculationOption": null,
"overageUnusedUnitsCreditOption": null,
"unusedUnitsCreditRates": null,
"usageRecordRatingOption": null,
"segment": 1,
"effectiveStartDate": "2016-08-30",
"effectiveEndDate": "2023-02-19",
"processedThroughDate": "2022-02-28",
"chargedThroughDate": "2022-03-30",
"done": false,
"triggerDate": null,
"triggerEvent": "CustomerAcceptance",
"endDateCondition": "Subscription_End",
"upToPeriodsType": null,
"upToPeriods": null,
"specificEndDate": null,
"mrr": 0.000000000,
"dmrc": 0.000000000,
"tcv": 0.000000000,
"dtcv": 0.000000000,
"originalOrderDate": null,
"amendedByOrderOn": null,
"description": "",
"HolidayStart__c": null,
"HolidayEnd__c": null,
"ForceSync__c": null
},
{
"id": "id",
"originalChargeId": "origChgId",
"productRatePlanChargeId": "2c92a0ff56fe33f001572334577d6606",
"number": "C-00336416",
"name": "Sunday",
"type": "Recurring",
"model": "FlatFee",
"uom": null,
"version": 7,
"pricingSummary": "GBP0",
"priceChangeOption": "NoChange",
"priceIncreasePercentage": null,
"currency": "GBP",
"price": 0.000000000,
"tiers": null,
"chargeModelConfiguration": null,
"inputArgumentId": null,
"includedUnits": null,
"overagePrice": null,
"discountPercentage": null,
"discountAmount": null,
"applyDiscountTo": null,
"discountLevel": null,
"discountClass": null,
"discountApplyDetails": [],
"billingDay": "DefaultFromCustomer",
"listPriceBase": "Per_Billing_Period",
"billingPeriod": "Month",
"specificBillingPeriod": null,
"billingTiming": "IN_ADVANCE",
"ratingGroup": null,
"billingPeriodAlignment": "AlignToCharge",
"quantity": 1.000000000,
"smoothingModel": null,
"numberOfPeriods": null,
"overageCalculationOption": null,
"overageUnusedUnitsCreditOption": null,
"unusedUnitsCreditRates": null,
"usageRecordRatingOption": null,
"segment": 1,
"effectiveStartDate": "2016-08-30",
"effectiveEndDate": "2023-02-19",
"processedThroughDate": "2022-02-28",
"chargedThroughDate": "2022-03-30",
"done": false,
"triggerDate": null,
"triggerEvent": "CustomerAcceptance",
"endDateCondition": "Subscription_End",
"upToPeriodsType": null,
"upToPeriods": null,
"specificEndDate": null,
"mrr": 0.000000000,
"dmrc": 0.000000000,
"tcv": 0.000000000,
"dtcv": 0.000000000,
"originalOrderDate": null,
"amendedByOrderOn": null,
"description": "",
"HolidayStart__c": null,
"HolidayEnd__c": null,
"ForceSync__c": null
}
],
"subscriptionProductFeatures": [],
"externallyManagedPlanId": null
}
],
"externallyManagedBy": null
}

